MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K42/mcu.h
// Register: U2RXPPS
#define U2RXPPS U2RXPPS
extern volatile unsigned char           U2RXPPS             __at(0x3AE8);
#ifndef _LIB_BUILD
asm("U2RXPPS equ 03AE8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXPPS                :6;
    };
} U2RXPPSbits_t;
extern volatile U2RXPPSbits_t U2RXPPSbits __at(0x3AE8);
// bitfield macros
#define _U2RXPPS_U2RXPPS_POSN                               0x0
#define _U2RXPPS_U2RXPPS_POSITION                           0x0
#define _U2RXPPS_U2RXPPS_SIZE                               0x6
#define _U2RXPPS_U2RXPPS_LENGTH                             0x6
#define _U2RXPPS_U2RXPPS_MASK                               0x3F

// Register: U2CTSPPS
#define U2CTSPPS U2CTSPPS
extern volatile unsigned char           U2CTSPPS            __at(0x3AE9);
#ifndef _LIB_BUILD
asm("U2CTSPPS equ 03AE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2CTSPPS               :6;
    };
} U2CTSPPSbits_t;
extern volatile U2CTSPPSbits_t U2CTSPPSbits __at(0x3AE9);
// bitfield macros
#define _U2CTSPPS_U2CTSPPS_POSN                             0x0
#define _U2CTSPPS_U2CTSPPS_POSITION                         0x0
#define _U2CTSPPS_U2CTSPPS_SIZE                             0x6
#define _U2CTSPPS_U2CTSPPS_LENGTH                           0x6
#define _U2CTSPPS_U2CTSPPS_MASK                             0x3F

// Register: DMA2BUF
#define DMA2BUF DMA2BUF
extern volatile unsigned char           DMA2BUF             __at(0x3BC9);
#ifndef _LIB_BUILD
asm("DMA2BUF equ 03BC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUF                    :8;
    };
    struct {
        unsigned BUF0                   :1;
        unsigned BUF1                   :1;
        unsigned BUF2                   :1;
        unsigned BUF3                   :1;
        unsigned BUF4                   :1;
        unsigned BUF5                   :1;
        unsigned BUF6                   :1;
        unsigned BUF7                   :1;
    };
    struct {
        unsigned DMA2BUF                :8;
    };
    struct {
        unsigned DMA2BUF0               :1;
        unsigned DMA2BUF1               :1;
        unsigned DMA2BUF2               :1;
        unsigned DMA2BUF3               :1;
        unsigned DMA2BUF4               :1;
        unsigned DMA2BUF5               :1;
        unsigned DMA2BUF6               :1;
        unsigned DMA2BUF7               :1;
    };
} DMA2BUFbits_t;
extern volatile DMA2BUFbits_t DMA2BUFbits __at(0x3BC9);
// bitfield macros
#define _DMA2BUF_BUF_POSN                                   0x0
#define _DMA2BUF_BUF_POSITION                               0x0
#define _DMA2BUF_BUF_SIZE                                   0x8
#define _DMA2BUF_BUF_LENGTH                                 0x8
#define _DMA2BUF_BUF_MASK                                   0xFF
#define _DMA2BUF_BUF0_POSN                                  0x0
#define _DMA2BUF_BUF0_POSITION                              0x0
#define _DMA2BUF_BUF0_SIZE                                  0x1
#define _DMA2BUF_BUF0_LENGTH                                0x1
#define _DMA2BUF_BUF0_MASK                                  0x1
#define _DMA2BUF_BUF1_POSN                                  0x1
#define _DMA2BUF_BUF1_POSITION                              0x1
#define _DMA2BUF_BUF1_SIZE                                  0x1
#define _DMA2BUF_BUF1_LENGTH                                0x1
#define _DMA2BUF_BUF1_MASK                                  0x2
#define _DMA2BUF_BUF2_POSN                                  0x2
#define _DMA2BUF_BUF2_POSITION                              0x2
#define _DMA2BUF_BUF2_SIZE                                  0x1
#define _DMA2BUF_BUF2_LENGTH                                0x1
#define _DMA2BUF_BUF2_MASK                                  0x4
#define _DMA2BUF_BUF3_POSN                                  0x3
#define _DMA2BUF_BUF3_POSITION                              0x3
#define _DMA2BUF_BUF3_SIZE                                  0x1
#define _DMA2BUF_BUF3_LENGTH                                0x1
#define _DMA2BUF_BUF3_MASK                                  0x8
#define _DMA2BUF_BUF4_POSN                                  0x4
#define _DMA2BUF_BUF4_POSITION                              0x4
#define _DMA2BUF_BUF4_SIZE                                  0x1
#define _DMA2BUF_BUF4_LENGTH                                0x1
#define _DMA2BUF_BUF4_MASK                                  0x10
#define _DMA2BUF_BUF5_POSN                                  0x5
#define _DMA2BUF_BUF5_POSITION                              0x5
#define _DMA2BUF_BUF5_SIZE                                  0x1
#define _DMA2BUF_BUF5_LENGTH                                0x1
#define _DMA2BUF_BUF5_MASK                                  0x20
#define _DMA2BUF_BUF6_POSN                                  0x6
#define _DMA2BUF_BUF6_POSITION                              0x6
#define _DMA2BUF_BUF6_SIZE                                  0x1
#define _DMA2BUF_BUF6_LENGTH                                0x1
#define _DMA2BUF_BUF6_MASK                                  0x40
#define _DMA2BUF_BUF7_POSN                                  0x7
#define _DMA2BUF_BUF7_POSITION                              0x7
#define _DMA2BUF_BUF7_SIZE                                  0x1
#define _DMA2BUF_BUF7_LENGTH                                0x1
#define _DMA2BUF_BUF7_MASK                                  0x80
#define _DMA2BUF_DMA2BUF_POSN                               0x0
#define _DMA2BUF_DMA2BUF_POSITION                           0x0
#define _DMA2BUF_DMA2BUF_SIZE                               0x8
#define _DMA2BUF_DMA2BUF_LENGTH                             0x8
#define _DMA2BUF_DMA2BUF_MASK                               0xFF
#define _DMA2BUF_DMA2BUF0_POSN                              0x0
#define _DMA2BUF_DMA2BUF0_POSITION                          0x0
#define _DMA2BUF_DMA2BUF0_SIZE                              0x1
#define _DMA2BUF_DMA2BUF0_LENGTH                            0x1
#define _DMA2BUF_DMA2BUF0_MASK                              0x1
#define _DMA2BUF_DMA2BUF1_POSN                              0x1
#define _DMA2BUF_DMA2BUF1_POSITION                          0x1
#define _DMA2BUF_DMA2BUF1_SIZE                              0x1
#define _DMA2BUF_DMA2BUF1_LENGTH                            0x1
#define _DMA2BUF_DMA2BUF1_MASK                              0x2
#define _DMA2BUF_DMA2BUF2_POSN                              0x2
#define _DMA2BUF_DMA2BUF2_POSITION                          0x2
#define _DMA2BUF_DMA2BUF2_SIZE                              0x1
#define _DMA2BUF_DMA2BUF2_LENGTH                            0x1
#define _DMA2BUF_DMA2BUF2_MASK                              0x4
#define _DMA2BUF_DMA2BUF3_POSN                              0x3
#define _DMA2BUF_DMA2BUF3_POSITION                          0x3
#define _DMA2BUF_DMA2BUF3_SIZE                              0x1
#define _DMA2BUF_DMA2BUF3_LENGTH                            0x1
#define _DMA2BUF_DMA2BUF3_MASK                              0x8
#define _DMA2BUF_DMA2BUF4_POSN                              0x4
#define _DMA2BUF_DMA2BUF4_POSITION                          0x4
#define _DMA2BUF_DMA2BUF4_SIZE                              0x1
#define _DMA2BUF_DMA2BUF4_LENGTH                            0x1
#define _DMA2BUF_DMA2BUF4_MASK                              0x10
#define _DMA2BUF_DMA2BUF5_POSN                              0x5
#define _DMA2BUF_DMA2BUF5_POSITION                          0x5
#define _DMA2BUF_DMA2BUF5_SIZE                              0x1
#define _DMA2BUF_DMA2BUF5_LENGTH                            0x1
#define _DMA2BUF_DMA2BUF5_MASK                              0x20
#define _DMA2BUF_DMA2BUF6_POSN                              0x6
#define _DMA2BUF_DMA2BUF6_POSITION                          0x6
#define _DMA2BUF_DMA2BUF6_SIZE                              0x1
#define _DMA2BUF_DMA2BUF6_LENGTH                            0x1
#define _DMA2BUF_DMA2BUF6_MASK                              0x40
#define _DMA2BUF_DMA2BUF7_POSN                              0x7
#define _DMA2BUF_DMA2BUF7_POSITION                          0x7
#define _DMA2BUF_DMA2BUF7_SIZE                              0x1
#define _DMA2BUF_DMA2BUF7_LENGTH                            0x1
#define _DMA2BUF_DMA2BUF7_MASK                              0x80

