MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K42/mcu.h
extern volatile I2C1ADB0bits_t I2C1ADB0bits __at(0x3D6D);
// bitfield macros
#define _I2C1ADB0_ADB_POSN                                  0x0
#define _I2C1ADB0_ADB_POSITION                              0x0
#define _I2C1ADB0_ADB_SIZE                                  0x8
#define _I2C1ADB0_ADB_LENGTH                                0x8
#define _I2C1ADB0_ADB_MASK                                  0xFF

// Register: I2C1ADB1
#define I2C1ADB1 I2C1ADB1
extern volatile unsigned char           I2C1ADB1            __at(0x3D6E);
#ifndef _LIB_BUILD
asm("I2C1ADB1 equ 03D6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C1ADB1bits_t;
extern volatile I2C1ADB1bits_t I2C1ADB1bits __at(0x3D6E);
// bitfield macros
#define _I2C1ADB1_ADB_POSN                                  0x0
#define _I2C1ADB1_ADB_POSITION                              0x0
#define _I2C1ADB1_ADB_SIZE                                  0x8
#define _I2C1ADB1_ADB_LENGTH                                0x8
#define _I2C1ADB1_ADB_MASK                                  0xFF

// Register: I2C1ADR0
#define I2C1ADR0 I2C1ADR0
extern volatile unsigned char           I2C1ADR0            __at(0x3D6F);
#ifndef _LIB_BUILD
asm("I2C1ADR0 equ 03D6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C1ADR0bits_t;
extern volatile I2C1ADR0bits_t I2C1ADR0bits __at(0x3D6F);
// bitfield macros
#define _I2C1ADR0_ADR_POSN                                  0x0
#define _I2C1ADR0_ADR_POSITION                              0x0
#define _I2C1ADR0_ADR_SIZE                                  0x8
#define _I2C1ADR0_ADR_LENGTH                                0x8
#define _I2C1ADR0_ADR_MASK                                  0xFF

// Register: I2C1ADR1
#define I2C1ADR1 I2C1ADR1
extern volatile unsigned char           I2C1ADR1            __at(0x3D70);
#ifndef _LIB_BUILD
asm("I2C1ADR1 equ 03D70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C1ADR1bits_t;
extern volatile I2C1ADR1bits_t I2C1ADR1bits __at(0x3D70);
// bitfield macros
#define _I2C1ADR1_ADR_POSN                                  0x1
#define _I2C1ADR1_ADR_POSITION                              0x1
#define _I2C1ADR1_ADR_SIZE                                  0x7
#define _I2C1ADR1_ADR_LENGTH                                0x7
#define _I2C1ADR1_ADR_MASK                                  0xFE

// Register: I2C1ADR2
#define I2C1ADR2 I2C1ADR2
extern volatile unsigned char           I2C1ADR2            __at(0x3D71);
#ifndef _LIB_BUILD
asm("I2C1ADR2 equ 03D71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C1ADR2bits_t;
extern volatile I2C1ADR2bits_t I2C1ADR2bits __at(0x3D71);
// bitfield macros
#define _I2C1ADR2_ADR_POSN                                  0x0
#define _I2C1ADR2_ADR_POSITION                              0x0
#define _I2C1ADR2_ADR_SIZE                                  0x8
#define _I2C1ADR2_ADR_LENGTH                                0x8
#define _I2C1ADR2_ADR_MASK                                  0xFF

// Register: I2C1ADR3
#define I2C1ADR3 I2C1ADR3
extern volatile unsigned char           I2C1ADR3            __at(0x3D72);
#ifndef _LIB_BUILD
asm("I2C1ADR3 equ 03D72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C1ADR3bits_t;
extern volatile I2C1ADR3bits_t I2C1ADR3bits __at(0x3D72);
// bitfield macros
#define _I2C1ADR3_ADR_POSN                                  0x1
#define _I2C1ADR3_ADR_POSITION                              0x1
#define _I2C1ADR3_ADR_SIZE                                  0x7
#define _I2C1ADR3_ADR_LENGTH                                0x7
#define _I2C1ADR3_ADR_MASK                                  0xFE

// Register: I2C1CON0
#define I2C1CON0 I2C1CON0
extern volatile unsigned char           I2C1CON0            __at(0x3D73);
#ifndef _LIB_BUILD
asm("I2C1CON0 equ 03D73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned MDR                    :1;
        unsigned CSTR                   :1;
        unsigned S                      :1;
        unsigned RSEN                   :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned                        :4;
        unsigned I2CEN                  :1;
    };
} I2C1CON0bits_t;
extern volatile I2C1CON0bits_t I2C1CON0bits __at(0x3D73);
// bitfield macros
#define _I2C1CON0_MODE_POSN                                 0x0
#define _I2C1CON0_MODE_POSITION                             0x0
#define _I2C1CON0_MODE_SIZE                                 0x3
#define _I2C1CON0_MODE_LENGTH                               0x3
#define _I2C1CON0_MODE_MASK                                 0x7
#define _I2C1CON0_MDR_POSN                                  0x3
#define _I2C1CON0_MDR_POSITION                              0x3
#define _I2C1CON0_MDR_SIZE                                  0x1
#define _I2C1CON0_MDR_LENGTH                                0x1
#define _I2C1CON0_MDR_MASK                                  0x8
#define _I2C1CON0_CSTR_POSN                                 0x4
#define _I2C1CON0_CSTR_POSITION                             0x4
#define _I2C1CON0_CSTR_SIZE                                 0x1
#define _I2C1CON0_CSTR_LENGTH                               0x1
#define _I2C1CON0_CSTR_MASK                                 0x10
#define _I2C1CON0_S_POSN                                    0x5
#define _I2C1CON0_S_POSITION                                0x5
#define _I2C1CON0_S_SIZE                                    0x1
#define _I2C1CON0_S_LENGTH                                  0x1
#define _I2C1CON0_S_MASK                                    0x20
#define _I2C1CON0_RSEN_POSN                                 0x6
#define _I2C1CON0_RSEN_POSITION                             0x6
#define _I2C1CON0_RSEN_SIZE                                 0x1
#define _I2C1CON0_RSEN_LENGTH                               0x1
#define _I2C1CON0_RSEN_MASK                                 0x40
#define _I2C1CON0_EN_POSN                                   0x7
#define _I2C1CON0_EN_POSITION                               0x7
#define _I2C1CON0_EN_SIZE                                   0x1
#define _I2C1CON0_EN_LENGTH                                 0x1
#define _I2C1CON0_EN_MASK                                   0x80
#define _I2C1CON0_MODE0_POSN                                0x0
#define _I2C1CON0_MODE0_POSITION                            0x0
#define _I2C1CON0_MODE0_SIZE                                0x1
#define _I2C1CON0_MODE0_LENGTH                              0x1
#define _I2C1CON0_MODE0_MASK                                0x1
#define _I2C1CON0_MODE1_POSN                                0x1
#define _I2C1CON0_MODE1_POSITION                            0x1
#define _I2C1CON0_MODE1_SIZE                                0x1
#define _I2C1CON0_MODE1_LENGTH                              0x1
#define _I2C1CON0_MODE1_MASK                                0x2
#define _I2C1CON0_MODE2_POSN                                0x2
#define _I2C1CON0_MODE2_POSITION                            0x2
#define _I2C1CON0_MODE2_SIZE                                0x1
#define _I2C1CON0_MODE2_LENGTH                              0x1
#define _I2C1CON0_MODE2_MASK                                0x4
#define _I2C1CON0_I2CEN_POSN                                0x7
#define _I2C1CON0_I2CEN_POSITION                            0x7
#define _I2C1CON0_I2CEN_SIZE                                0x1
#define _I2C1CON0_I2CEN_LENGTH                              0x1
#define _I2C1CON0_I2CEN_MASK                                0x80

// Register: I2C1CON1
#define I2C1CON1 I2C1CON1
extern volatile unsigned char           I2C1CON1            __at(0x3D74);
#ifndef _LIB_BUILD
asm("I2C1CON1 equ 03D74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSD                    :1;
        unsigned TXU                    :1;
        unsigned RXO                    :1;
        unsigned                        :1;
        unsigned ACKT                   :1;
        unsigned ACKSTAT                :1;
        unsigned ACKDT                  :1;
        unsigned ACKCNT                 :1;
    };
} I2C1CON1bits_t;
extern volatile I2C1CON1bits_t I2C1CON1bits __at(0x3D74);
// bitfield macros
#define _I2C1CON1_CSD_POSN                                  0x0
#define _I2C1CON1_CSD_POSITION                              0x0
#define _I2C1CON1_CSD_SIZE                                  0x1
#define _I2C1CON1_CSD_LENGTH                                0x1
#define _I2C1CON1_CSD_MASK                                  0x1
#define _I2C1CON1_TXU_POSN                                  0x1
#define _I2C1CON1_TXU_POSITION                              0x1
#define _I2C1CON1_TXU_SIZE                                  0x1
#define _I2C1CON1_TXU_LENGTH                                0x1
#define _I2C1CON1_TXU_MASK                                  0x2
#define _I2C1CON1_RXO_POSN                                  0x2
#define _I2C1CON1_RXO_POSITION                              0x2
#define _I2C1CON1_RXO_SIZE                                  0x1
#define _I2C1CON1_RXO_LENGTH                                0x1
#define _I2C1CON1_RXO_MASK                                  0x4
#define _I2C1CON1_ACKT_POSN                                 0x4
#define _I2C1CON1_ACKT_POSITION                             0x4
#define _I2C1CON1_ACKT_SIZE                                 0x1
#define _I2C1CON1_ACKT_LENGTH                               0x1
#define _I2C1CON1_ACKT_MASK                                 0x10
#define _I2C1CON1_ACKSTAT_POSN                              0x5
#define _I2C1CON1_ACKSTAT_POSITION                          0x5
#define _I2C1CON1_ACKSTAT_SIZE                              0x1
#define _I2C1CON1_ACKSTAT_LENGTH                            0x1
#define _I2C1CON1_ACKSTAT_MASK                              0x20
#define _I2C1CON1_ACKDT_POSN                                0x6
#define _I2C1CON1_ACKDT_POSITION                            0x6
#define _I2C1CON1_ACKDT_SIZE                                0x1
#define _I2C1CON1_ACKDT_LENGTH                              0x1
#define _I2C1CON1_ACKDT_MASK                                0x40
#define _I2C1CON1_ACKCNT_POSN                               0x7
#define _I2C1CON1_ACKCNT_POSITION                           0x7
#define _I2C1CON1_ACKCNT_SIZE                               0x1
#define _I2C1CON1_ACKCNT_LENGTH                             0x1
#define _I2C1CON1_ACKCNT_MASK                               0x80

