MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K42/mcu.h
extern volatile __bit                   CH2                 __at(0x1E7F2);	// @ (0x3CFE * 8 + 2)
#define                                 CH2_bit             _BIT_ACCESS(MD1CARH,2)
// MD1CARH<CH3>
extern volatile __bit                   CH3                 __at(0x1E7F3);	// @ (0x3CFE * 8 + 3)
#define                                 CH3_bit             _BIT_ACCESS(MD1CARH,3)
// MD1CARH<CH4>
extern volatile __bit                   CH4                 __at(0x1E7F4);	// @ (0x3CFE * 8 + 4)
#define                                 CH4_bit             _BIT_ACCESS(MD1CARH,4)
// MD1CON1<CHPOL>
extern volatile __bit                   CHPOL               __at(0x1E7DD);	// @ (0x3CFB * 8 + 5)
#define                                 CHPOL_bit           _BIT_ACCESS(MD1CON1,5)
// MD1CON1<CHSYNC>
extern volatile __bit                   CHSYNC              __at(0x1E7DC);	// @ (0x3CFB * 8 + 4)
#define                                 CHSYNC_bit          _BIT_ACCESS(MD1CON1,4)
// SPI1CON1<CKE>
extern volatile __bit                   CKE                 __at(0x1E8AE);	// @ (0x3D15 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SPI1CON1,6)
// SPI1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x1E8AD);	// @ (0x3D15 * 8 + 5)
#define                                 CKP_bit             _BIT_ACCESS(SPI1CON1,5)
// T0CON1<CKPS3>
extern volatile __bit                   CKPS3               __at(0x1FDCB);	// @ (0x3FB9 * 8 + 3)
#define                                 CKPS3_bit           _BIT_ACCESS(T0CON1,3)
// NCO1CLK<CKS0>
extern volatile __bit                   CKS0                __at(0x1F9F8);	// @ (0x3F3F * 8 + 0)
#define                                 CKS0_bit            _BIT_ACCESS(NCO1CLK,0)
// NCO1CLK<CKS1>
extern volatile __bit                   CKS1                __at(0x1F9F9);	// @ (0x3F3F * 8 + 1)
#define                                 CKS1_bit            _BIT_ACCESS(NCO1CLK,1)
// NCO1CLK<CKS2>
extern volatile __bit                   CKS2                __at(0x1F9FA);	// @ (0x3F3F * 8 + 2)
#define                                 CKS2_bit            _BIT_ACCESS(NCO1CLK,2)
// NCO1CLK<CKS3>
extern volatile __bit                   CKS3                __at(0x1F9FB);	// @ (0x3F3F * 8 + 3)
#define                                 CKS3_bit            _BIT_ACCESS(NCO1CLK,3)
// MD1CARL<CL0>
extern volatile __bit                   CL0                 __at(0x1E7E8);	// @ (0x3CFD * 8 + 0)
#define                                 CL0_bit             _BIT_ACCESS(MD1CARL,0)
// MD1CARL<CL1>
extern volatile __bit                   CL1                 __at(0x1E7E9);	// @ (0x3CFD * 8 + 1)
#define                                 CL1_bit             _BIT_ACCESS(MD1CARL,1)
// MD1CARL<CL2>
extern volatile __bit                   CL2                 __at(0x1E7EA);	// @ (0x3CFD * 8 + 2)
#define                                 CL2_bit             _BIT_ACCESS(MD1CARL,2)
// MD1CARL<CL3>
extern volatile __bit                   CL3                 __at(0x1E7EB);	// @ (0x3CFD * 8 + 3)
#define                                 CL3_bit             _BIT_ACCESS(MD1CARL,3)
// MD1CARL<CL4>
extern volatile __bit                   CL4                 __at(0x1E7EC);	// @ (0x3CFD * 8 + 4)
#define                                 CL4_bit             _BIT_ACCESS(MD1CARL,4)
// PIE4<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x1CCA7);	// @ (0x3994 * 8 + 7)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE4,7)
// PIR4<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x1CD27);	// @ (0x39A4 * 8 + 7)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR4,7)
// IPR4<CLC1IP>
extern volatile __bit                   CLC1IP              __at(0x1CC27);	// @ (0x3984 * 8 + 7)
#define                                 CLC1IP_bit          _BIT_ACCESS(IPR4,7)
// PMD6<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x1CE31);	// @ (0x39C6 * 8 + 1)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD6,1)
// CLCDATA0<CLC1OUT>
extern volatile __bit                   CLC1OUT             __at(0x1E3F0);	// @ (0x3C7E * 8 + 0)
#define                                 CLC1OUT_bit         _BIT_ACCESS(CLCDATA0,0)
// PIE7<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x1CCBC);	// @ (0x3997 * 8 + 4)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE7,4)
// PIR7<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x1CD3C);	// @ (0x39A7 * 8 + 4)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR7,4)
// IPR7<CLC2IP>
extern volatile __bit                   CLC2IP              __at(0x1CC3C);	// @ (0x3987 * 8 + 4)
#define                                 CLC2IP_bit          _BIT_ACCESS(IPR7,4)
// PMD6<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x1CE32);	// @ (0x39C6 * 8 + 2)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD6,2)
// CLCDATA0<CLC2OUT>
extern volatile __bit                   CLC2OUT             __at(0x1E3F1);	// @ (0x3C7E * 8 + 1)
#define                                 CLC2OUT_bit         _BIT_ACCESS(CLCDATA0,1)
// PIE9<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x1CCCB);	// @ (0x3999 * 8 + 3)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE9,3)
// PIR9<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x1CD4B);	// @ (0x39A9 * 8 + 3)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR9,3)
// IPR9<CLC3IP>
extern volatile __bit                   CLC3IP              __at(0x1CC4B);	// @ (0x3989 * 8 + 3)
#define                                 CLC3IP_bit          _BIT_ACCESS(IPR9,3)
// PMD6<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x1CE33);	// @ (0x39C6 * 8 + 3)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD6,3)
// CLCDATA0<CLC3OUT>
extern volatile __bit                   CLC3OUT             __at(0x1E3F2);	// @ (0x3C7E * 8 + 2)
#define                                 CLC3OUT_bit         _BIT_ACCESS(CLCDATA0,2)
// PIE10<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x1CCD1);	// @ (0x399A * 8 + 1)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE10,1)
// PIR10<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x1CD51);	// @ (0x39AA * 8 + 1)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR10,1)
// IPR10<CLC4IP>
extern volatile __bit                   CLC4IP              __at(0x1CC51);	// @ (0x398A * 8 + 1)
#define                                 CLC4IP_bit          _BIT_ACCESS(IPR10,1)
// PMD6<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x1CE34);	// @ (0x39C6 * 8 + 4)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD6,4)
// CLCDATA0<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0x1E3F3);	// @ (0x3C7E * 8 + 3)
#define                                 CLC4OUT_bit         _BIT_ACCESS(CLCDATA0,3)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x1E730);	// @ (0x3CE6 * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x1E731);	// @ (0x3CE6 * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x1E732);	// @ (0x3CE6 * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x1E733);	// @ (0x3CE6 * 8 + 3)
#define                                 CLKRCLK3_bit        _BIT_ACCESS(CLKRCLK,3)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x1E72B);	// @ (0x3CE5 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x1E72C);	// @ (0x3CE5 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x1E728);	// @ (0x3CE5 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x1E729);	// @ (0x3CE5 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x1E72A);	// @ (0x3CE5 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x1E72F);	// @ (0x3CE5 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x1CE01);	// @ (0x39C0 * 8 + 1)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,1)
// SPI1CLK<CLKSEL0>
extern volatile __bit                   CLKSEL0             __at(0x1E8E0);	// @ (0x3D1C * 8 + 0)
#define                                 CLKSEL0_bit         _BIT_ACCESS(SPI1CLK,0)
// SPI1CLK<CLKSEL1>
extern volatile __bit                   CLKSEL1             __at(0x1E8E1);	// @ (0x3D1C * 8 + 1)
#define                                 CLKSEL1_bit         _BIT_ACCESS(SPI1CLK,1)
// SPI1CLK<CLKSEL2>
extern volatile __bit                   CLKSEL2             __at(0x1E8E2);	// @ (0x3D1C * 8 + 2)
#define                                 CLKSEL2_bit         _BIT_ACCESS(SPI1CLK,2)
// SPI1CLK<CLKSEL3>
extern volatile __bit                   CLKSEL3             __at(0x1E8E3);	// @ (0x3D1C * 8 + 3)
#define                                 CLKSEL3_bit         _BIT_ACCESS(SPI1CLK,3)
// MD1CON1<CLPOL>
extern volatile __bit                   CLPOL               __at(0x1E7D9);	// @ (0x3CFB * 8 + 1)
#define                                 CLPOL_bit           _BIT_ACCESS(MD1CON1,1)
// MD1CON1<CLSYNC>
extern volatile __bit                   CLSYNC              __at(0x1E7D8);	// @ (0x3CFB * 8 + 0)
#define                                 CLSYNC_bit          _BIT_ACCESS(MD1CON1,0)
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x1CE11);	// @ (0x39C2 * 8 + 1)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD2,1)
// PMD2<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x1CE12);	// @ (0x39C2 * 8 + 2)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD2,2)
// I2C1PIE<CNT1IE>
extern volatile __bit                   CNT1IE              __at(0x1EBD7);	// @ (0x3D7A * 8 + 7)
#define                                 CNT1IE_bit          _BIT_ACCESS(I2C1PIE,7)
// I2C1PIR<CNT1IF>
extern volatile __bit                   CNT1IF              __at(0x1EBCF);	// @ (0x3D79 * 8 + 7)
#define                                 CNT1IF_bit          _BIT_ACCESS(I2C1PIR,7)
// I2C2PIE<CNT2IE>
extern volatile __bit                   CNT2IE              __at(0x1EB27);	// @ (0x3D64 * 8 + 7)
#define                                 CNT2IE_bit          _BIT_ACCESS(I2C2PIE,7)
// I2C2PIR<CNT2IF>
extern volatile __bit                   CNT2IF              __at(0x1EB1F);	// @ (0x3D63 * 8 + 7)
#define                                 CNT2IF_bit          _BIT_ACCESS(I2C2PIR,7)
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0x1F7C6);	// @ (0x3EF8 * 8 + 6)
#define                                 CONT_bit            _BIT_ACCESS(ADCON0,6)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x1CED4);	// @ (0x39DA * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x1CED5);	// @ (0x39DA * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x1CED6);	// @ (0x39DA * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// SMT1CON0<CPOL>
extern volatile __bit                   CPOL                __at(0x1F8F2);	// @ (0x3F1E * 8 + 2)
#define                                 CPOL_bit            _BIT_ACCESS(SMT1CON0,2)
// ADCP<CPON>
extern volatile __bit                   CPON                __at(0x1F6BF);	// @ (0x3ED7 * 8 + 7)
#define                                 CPON_bit            _BIT_ACCESS(ADCP,7)
// SMT1CPRL<CPR0>
extern volatile __bit                   CPR0                __at(0x1F8A8);	// @ (0x3F15 * 8 + 0)
#define                                 CPR0_bit            _BIT_ACCESS(SMT1CPRL,0)
// SMT1CPRL<CPR1>
extern volatile __bit                   CPR1                __at(0x1F8A9);	// @ (0x3F15 * 8 + 1)
#define                                 CPR1_bit            _BIT_ACCESS(SMT1CPRL,1)
// SMT1CPRH<CPR10>
extern volatile __bit                   CPR10               __at(0x1F8B2);	// @ (0x3F16 * 8 + 2)
#define                                 CPR10_bit           _BIT_ACCESS(SMT1CPRH,2)
// SMT1CPRH<CPR11>
extern volatile __bit                   CPR11               __at(0x1F8B3);	// @ (0x3F16 * 8 + 3)
#define                                 CPR11_bit           _BIT_ACCESS(SMT1CPRH,3)
// SMT1CPRH<CPR12>
extern volatile __bit                   CPR12               __at(0x1F8B4);	// @ (0x3F16 * 8 + 4)
#define                                 CPR12_bit           _BIT_ACCESS(SMT1CPRH,4)
// SMT1CPRH<CPR13>
extern volatile __bit                   CPR13               __at(0x1F8B5);	// @ (0x3F16 * 8 + 5)
#define                                 CPR13_bit           _BIT_ACCESS(SMT1CPRH,5)
// SMT1CPRH<CPR14>
extern volatile __bit                   CPR14               __at(0x1F8B6);	// @ (0x3F16 * 8 + 6)
#define                                 CPR14_bit           _BIT_ACCESS(SMT1CPRH,6)
// SMT1CPRH<CPR15>
extern volatile __bit                   CPR15               __at(0x1F8B7);	// @ (0x3F16 * 8 + 7)
#define                                 CPR15_bit           _BIT_ACCESS(SMT1CPRH,7)
// SMT1CPRU<CPR16>
extern volatile __bit                   CPR16               __at(0x1F8B8);	// @ (0x3F17 * 8 + 0)
#define                                 CPR16_bit           _BIT_ACCESS(SMT1CPRU,0)
// SMT1CPRU<CPR17>
extern volatile __bit                   CPR17               __at(0x1F8B9);	// @ (0x3F17 * 8 + 1)
#define                                 CPR17_bit           _BIT_ACCESS(SMT1CPRU,1)
// SMT1CPRU<CPR18>
extern volatile __bit                   CPR18               __at(0x1F8BA);	// @ (0x3F17 * 8 + 2)
#define                                 CPR18_bit           _BIT_ACCESS(SMT1CPRU,2)
// SMT1CPRU<CPR19>
extern volatile __bit                   CPR19               __at(0x1F8BB);	// @ (0x3F17 * 8 + 3)
#define                                 CPR19_bit           _BIT_ACCESS(SMT1CPRU,3)
// SMT1CPRL<CPR2>
extern volatile __bit                   CPR2                __at(0x1F8AA);	// @ (0x3F15 * 8 + 2)
#define                                 CPR2_bit            _BIT_ACCESS(SMT1CPRL,2)
// SMT1CPRU<CPR20>
extern volatile __bit                   CPR20               __at(0x1F8BC);	// @ (0x3F17 * 8 + 4)
#define                                 CPR20_bit           _BIT_ACCESS(SMT1CPRU,4)
// SMT1CPRU<CPR21>
extern volatile __bit                   CPR21               __at(0x1F8BD);	// @ (0x3F17 * 8 + 5)
#define                                 CPR21_bit           _BIT_ACCESS(SMT1CPRU,5)
// SMT1CPRU<CPR22>
extern volatile __bit                   CPR22               __at(0x1F8BE);	// @ (0x3F17 * 8 + 6)
#define                                 CPR22_bit           _BIT_ACCESS(SMT1CPRU,6)
// SMT1CPRU<CPR23>
extern volatile __bit                   CPR23               __at(0x1F8BF);	// @ (0x3F17 * 8 + 7)
#define                                 CPR23_bit           _BIT_ACCESS(SMT1CPRU,7)
// SMT1CPRL<CPR3>
extern volatile __bit                   CPR3                __at(0x1F8AB);	// @ (0x3F15 * 8 + 3)
#define                                 CPR3_bit            _BIT_ACCESS(SMT1CPRL,3)
// SMT1CPRL<CPR4>
extern volatile __bit                   CPR4                __at(0x1F8AC);	// @ (0x3F15 * 8 + 4)
#define                                 CPR4_bit            _BIT_ACCESS(SMT1CPRL,4)
// SMT1CPRL<CPR5>
extern volatile __bit                   CPR5                __at(0x1F8AD);	// @ (0x3F15 * 8 + 5)
#define                                 CPR5_bit            _BIT_ACCESS(SMT1CPRL,5)
// SMT1CPRL<CPR6>
extern volatile __bit                   CPR6                __at(0x1F8AE);	// @ (0x3F15 * 8 + 6)
#define                                 CPR6_bit            _BIT_ACCESS(SMT1CPRL,6)
// SMT1CPRL<CPR7>
extern volatile __bit                   CPR7                __at(0x1F8AF);	// @ (0x3F15 * 8 + 7)
#define                                 CPR7_bit            _BIT_ACCESS(SMT1CPRL,7)
// SMT1CPRH<CPR8>
extern volatile __bit                   CPR8                __at(0x1F8B0);	// @ (0x3F16 * 8 + 0)
#define                                 CPR8_bit            _BIT_ACCESS(SMT1CPRH,0)
// SMT1CPRH<CPR9>
extern volatile __bit                   CPR9                __at(0x1F8B1);	// @ (0x3F16 * 8 + 1)
#define                                 CPR9_bit            _BIT_ACCESS(SMT1CPRH,1)
// ADCP<CPRDY>
extern volatile __bit                   CPRDY               __at(0x1F6B8);	// @ (0x3ED7 * 8 + 0)
#define                                 CPRDY_bit           _BIT_ACCESS(ADCP,0)
// SMT1STAT<CPRUP>
extern volatile __bit                   CPRUP               __at(0x1F907);	// @ (0x3F20 * 8 + 7)
#define                                 CPRUP_bit           _BIT_ACCESS(SMT1STAT,7)
// SMT1CPWL<CPW0>
extern volatile __bit                   CPW0                __at(0x1F8C0);	// @ (0x3F18 * 8 + 0)
#define                                 CPW0_bit            _BIT_ACCESS(SMT1CPWL,0)
// SMT1CPWL<CPW1>
extern volatile __bit                   CPW1                __at(0x1F8C1);	// @ (0x3F18 * 8 + 1)
#define                                 CPW1_bit            _BIT_ACCESS(SMT1CPWL,1)
// SMT1CPWH<CPW10>
extern volatile __bit                   CPW10               __at(0x1F8CA);	// @ (0x3F19 * 8 + 2)
#define                                 CPW10_bit           _BIT_ACCESS(SMT1CPWH,2)
// SMT1CPWH<CPW11>
extern volatile __bit                   CPW11               __at(0x1F8CB);	// @ (0x3F19 * 8 + 3)
#define                                 CPW11_bit           _BIT_ACCESS(SMT1CPWH,3)
// SMT1CPWH<CPW12>
extern volatile __bit                   CPW12               __at(0x1F8CC);	// @ (0x3F19 * 8 + 4)
#define                                 CPW12_bit           _BIT_ACCESS(SMT1CPWH,4)
// SMT1CPWH<CPW13>
extern volatile __bit                   CPW13               __at(0x1F8CD);	// @ (0x3F19 * 8 + 5)
#define                                 CPW13_bit           _BIT_ACCESS(SMT1CPWH,5)
// SMT1CPWH<CPW14>
extern volatile __bit                   CPW14               __at(0x1F8CE);	// @ (0x3F19 * 8 + 6)
#define                                 CPW14_bit           _BIT_ACCESS(SMT1CPWH,6)
// SMT1CPWH<CPW15>
extern volatile __bit                   CPW15               __at(0x1F8CF);	// @ (0x3F19 * 8 + 7)
#define                                 CPW15_bit           _BIT_ACCESS(SMT1CPWH,7)
// SMT1CPWU<CPW16>
extern volatile __bit                   CPW16               __at(0x1F8D0);	// @ (0x3F1A * 8 + 0)
#define                                 CPW16_bit           _BIT_ACCESS(SMT1CPWU,0)
// SMT1CPWU<CPW17>
extern volatile __bit                   CPW17               __at(0x1F8D1);	// @ (0x3F1A * 8 + 1)
#define                                 CPW17_bit           _BIT_ACCESS(SMT1CPWU,1)
// SMT1CPWU<CPW18>
extern volatile __bit                   CPW18               __at(0x1F8D2);	// @ (0x3F1A * 8 + 2)
#define                                 CPW18_bit           _BIT_ACCESS(SMT1CPWU,2)
// SMT1CPWU<CPW19>
extern volatile __bit                   CPW19               __at(0x1F8D3);	// @ (0x3F1A * 8 + 3)
#define                                 CPW19_bit           _BIT_ACCESS(SMT1CPWU,3)
// SMT1CPWL<CPW2>
extern volatile __bit                   CPW2                __at(0x1F8C2);	// @ (0x3F18 * 8 + 2)
#define                                 CPW2_bit            _BIT_ACCESS(SMT1CPWL,2)
// SMT1CPWU<CPW20>
extern volatile __bit                   CPW20               __at(0x1F8D4);	// @ (0x3F1A * 8 + 4)
#define                                 CPW20_bit           _BIT_ACCESS(SMT1CPWU,4)
// SMT1CPWU<CPW21>
extern volatile __bit                   CPW21               __at(0x1F8D5);	// @ (0x3F1A * 8 + 5)
#define                                 CPW21_bit           _BIT_ACCESS(SMT1CPWU,5)
// SMT1CPWU<CPW22>
extern volatile __bit                   CPW22               __at(0x1F8D6);	// @ (0x3F1A * 8 + 6)
#define                                 CPW22_bit           _BIT_ACCESS(SMT1CPWU,6)
// SMT1CPWU<CPW23>
extern volatile __bit                   CPW23               __at(0x1F8D7);	// @ (0x3F1A * 8 + 7)
#define                                 CPW23_bit           _BIT_ACCESS(SMT1CPWU,7)
// SMT1CPWL<CPW3>
extern volatile __bit                   CPW3                __at(0x1F8C3);	// @ (0x3F18 * 8 + 3)
#define                                 CPW3_bit            _BIT_ACCESS(SMT1CPWL,3)
// SMT1CPWL<CPW4>
extern volatile __bit                   CPW4                __at(0x1F8C4);	// @ (0x3F18 * 8 + 4)
#define                                 CPW4_bit            _BIT_ACCESS(SMT1CPWL,4)
// SMT1CPWL<CPW5>
extern volatile __bit                   CPW5                __at(0x1F8C5);	// @ (0x3F18 * 8 + 5)
#define                                 CPW5_bit            _BIT_ACCESS(SMT1CPWL,5)
// SMT1CPWL<CPW6>
extern volatile __bit                   CPW6                __at(0x1F8C6);	// @ (0x3F18 * 8 + 6)
#define                                 CPW6_bit            _BIT_ACCESS(SMT1CPWL,6)
// SMT1CPWL<CPW7>
extern volatile __bit                   CPW7                __at(0x1F8C7);	// @ (0x3F18 * 8 + 7)
#define                                 CPW7_bit            _BIT_ACCESS(SMT1CPWL,7)
// SMT1CPWH<CPW8>
extern volatile __bit                   CPW8                __at(0x1F8C8);	// @ (0x3F19 * 8 + 0)
#define                                 CPW8_bit            _BIT_ACCESS(SMT1CPWH,0)
// SMT1CPWH<CPW9>
extern volatile __bit                   CPW9                __at(0x1F8C9);	// @ (0x3F19 * 8 + 1)
#define                                 CPW9_bit            _BIT_ACCESS(SMT1CPWH,1)
// SMT1STAT<CPWUP>
extern volatile __bit                   CPWUP               __at(0x1F906);	// @ (0x3F20 * 8 + 6)
#define                                 CPWUP_bit           _BIT_ACCESS(SMT1STAT,6)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0x1CB47);	// @ (0x3968 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0x1CB46);	// @ (0x3968 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE0<CRCIE>
extern volatile __bit                   CRCIE               __at(0x1CC86);	// @ (0x3990 * 8 + 6)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE0,6)
// PIR0<CRCIF>
extern volatile __bit                   CRCIF               __at(0x1CD06);	// @ (0x39A0 * 8 + 6)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR0,6)
// IPR0<CRCIP>
