MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K42/mcu.h
#define                                 NCO1POL_bit         _BIT_ACCESS(NCO1CON,4)
// NCO1CLK<NCO1PWS0>
extern volatile __bit                   NCO1PWS0            __at(0x1F9FD);	// @ (0x3F3F * 8 + 5)
#define                                 NCO1PWS0_bit        _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<NCO1PWS1>
extern volatile __bit                   NCO1PWS1            __at(0x1F9FE);	// @ (0x3F3F * 8 + 6)
#define                                 NCO1PWS1_bit        _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<NCO1PWS2>
extern volatile __bit                   NCO1PWS2            __at(0x1F9FF);	// @ (0x3F3F * 8 + 7)
#define                                 NCO1PWS2_bit        _BIT_ACCESS(NCO1CLK,7)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x1CEC8);	// @ (0x39D9 * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x1CEC9);	// @ (0x39D9 * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x1CECA);	// @ (0x39D9 * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x1CECB);	// @ (0x39D9 * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// STATUS<NEGATIVE>
extern volatile __bit                   NEGATIVE            __at(0x1FEC4);	// @ (0x3FD8 * 8 + 4)
#define                                 NEGATIVE_bit        _BIT_ACCESS(STATUS,4)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x1CECC);	// @ (0x39D9 * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x1CECD);	// @ (0x39D9 * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x1CECE);	// @ (0x39D9 * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x1CEDB);	// @ (0x39DB * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// PCON0<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x1FF80);	// @ (0x3FF0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(PCON0,0)
// PCON1<NOT_MEMV>
extern volatile __bit                   NOT_MEMV            __at(0x1FF89);	// @ (0x3FF1 * 8 + 1)
#define                                 NOT_MEMV_bit        _BIT_ACCESS(PCON1,1)
// PCON0<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x1FF81);	// @ (0x3FF0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(PCON0,1)
// PCON0<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x1FF82);	// @ (0x3FF0 * 8 + 2)
#define                                 NOT_RI_bit          _BIT_ACCESS(PCON0,2)
// PCON0<NOT_RMCLR>
extern volatile __bit                   NOT_RMCLR           __at(0x1FF83);	// @ (0x3FF0 * 8 + 3)
#define                                 NOT_RMCLR_bit       _BIT_ACCESS(PCON0,3)
// PCON0<NOT_RWDT>
extern volatile __bit                   NOT_RWDT            __at(0x1FF84);	// @ (0x3FF0 * 8 + 4)
#define                                 NOT_RWDT_bit        _BIT_ACCESS(PCON0,4)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x1FD9B);	// @ (0x3FB3 * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x1FD92);	// @ (0x3FB2 * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3GCON<NOT_T3DONE>
extern volatile __bit                   NOT_T3DONE          __at(0x1FD3B);	// @ (0x3FA7 * 8 + 3)
#define                                 NOT_T3DONE_bit      _BIT_ACCESS(T3GCON,3)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x1FD32);	// @ (0x3FA6 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// T5GCON<NOT_T5DONE>
extern volatile __bit                   NOT_T5DONE          __at(0x1FCDB);	// @ (0x3F9B * 8 + 3)
#define                                 NOT_T5DONE_bit      _BIT_ACCESS(T5GCON,3)
// T5CON<NOT_T5SYNC>
extern volatile __bit                   NOT_T5SYNC          __at(0x1FCD2);	// @ (0x3F9A * 8 + 2)
#define                                 NOT_T5SYNC_bit      _BIT_ACCESS(T5CON,2)
// PCON0<NOT_WDTWV>
extern volatile __bit                   NOT_WDTWV           __at(0x1FF85);	// @ (0x3FF0 * 8 + 5)
#define                                 NOT_WDTWV_bit       _BIT_ACCESS(PCON0,5)
// ADREF<NREF0>
extern volatile __bit                   NREF0               __at(0x1F7EC);	// @ (0x3EFD * 8 + 4)
#define                                 NREF0_bit           _BIT_ACCESS(ADREF,4)
// DAC1CON0<NSS>
extern volatile __bit                   NSS                 __at(0x1F4F0);	// @ (0x3E9E * 8 + 0)
#define                                 NSS_bit             _BIT_ACCESS(DAC1CON0,0)
// NVMADRL<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0x1CF00);	// @ (0x39E0 * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0x1CF01);	// @ (0x39E0 * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADRL,1)
// NVMADRL<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0x1CF02);	// @ (0x39E0 * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADRL,2)
// NVMADRL<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0x1CF03);	// @ (0x39E0 * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0x1CF04);	// @ (0x39E0 * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x1CF05);	// @ (0x39E0 * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0x1CF06);	// @ (0x39E0 * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0x1CF07);	// @ (0x39E0 * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMDAT<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x1CF18);	// @ (0x39E3 * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDAT,0)
// NVMDAT<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x1CF19);	// @ (0x39E3 * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDAT,1)
// NVMDAT<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x1CF1A);	// @ (0x39E3 * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDAT,2)
// NVMDAT<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x1CF1B);	// @ (0x39E3 * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDAT,3)
// NVMDAT<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x1CF1C);	// @ (0x39E3 * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDAT,4)
// NVMDAT<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x1CF1D);	// @ (0x39E3 * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDAT,5)
// NVMDAT<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x1CF1E);	// @ (0x39E3 * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDAT,6)
// NVMDAT<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x1CF1F);	// @ (0x39E3 * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDAT,7)
// PIE0<NVMIE>
extern volatile __bit                   NVMIE               __at(0x1CC84);	// @ (0x3990 * 8 + 4)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE0,4)
// PIR0<NVMIF>
extern volatile __bit                   NVMIF               __at(0x1CD04);	// @ (0x39A0 * 8 + 4)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR0,4)
// IPR0<NVMIP>
extern volatile __bit                   NVMIP               __at(0x1CC04);	// @ (0x3980 * 8 + 4)
#define                                 NVMIP_bit           _BIT_ACCESS(IPR0,4)
// PMD0<NVMMD>
extern volatile __bit                   NVMMD               __at(0x1CE02);	// @ (0x39C0 * 8 + 2)
#define                                 NVMMD_bit           _BIT_ACCESS(PMD0,2)
// NVMCON1<NVMREG0>
extern volatile __bit                   NVMREG0             __at(0x1CF2E);	// @ (0x39E5 * 8 + 6)
#define                                 NVMREG0_bit         _BIT_ACCESS(NVMCON1,6)
// NVMCON1<NVMREG1>
extern volatile __bit                   NVMREG1             __at(0x1CF2F);	// @ (0x39E5 * 8 + 7)
#define                                 NVMREG1_bit         _BIT_ACCESS(NVMCON1,7)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0x1D210);	// @ (0x3A42 * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x1D211);	// @ (0x3A42 * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x1D212);	// @ (0x3A42 * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA3>
extern volatile __bit                   ODCA3               __at(0x1D213);	// @ (0x3A42 * 8 + 3)
#define                                 ODCA3_bit           _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x1D214);	// @ (0x3A42 * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x1D215);	// @ (0x3A42 * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONA<ODCA6>
extern volatile __bit                   ODCA6               __at(0x1D216);	// @ (0x3A42 * 8 + 6)
#define                                 ODCA6_bit           _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCA7>
extern volatile __bit                   ODCA7               __at(0x1D217);	// @ (0x3A42 * 8 + 7)
#define                                 ODCA7_bit           _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCB0>
extern volatile __bit                   ODCB0               __at(0x1D290);	// @ (0x3A52 * 8 + 0)
#define                                 ODCB0_bit           _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCB1>
extern volatile __bit                   ODCB1               __at(0x1D291);	// @ (0x3A52 * 8 + 1)
#define                                 ODCB1_bit           _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCB2>
extern volatile __bit                   ODCB2               __at(0x1D292);	// @ (0x3A52 * 8 + 2)
#define                                 ODCB2_bit           _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCB3>
extern volatile __bit                   ODCB3               __at(0x1D293);	// @ (0x3A52 * 8 + 3)
#define                                 ODCB3_bit           _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0x1D294);	// @ (0x3A52 * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0x1D295);	// @ (0x3A52 * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0x1D296);	// @ (0x3A52 * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0x1D297);	// @ (0x3A52 * 8 + 7)
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x1D310);	// @ (0x3A62 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x1D311);	// @ (0x3A62 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x1D312);	// @ (0x3A62 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x1D313);	// @ (0x3A62 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x1D314);	// @ (0x3A62 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x1D315);	// @ (0x3A62 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x1D316);	// @ (0x3A62 * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0x1D317);	// @ (0x3A62 * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// ODCOND<ODCD0>
extern volatile __bit                   ODCD0               __at(0x1D390);	// @ (0x3A72 * 8 + 0)
#define                                 ODCD0_bit           _BIT_ACCESS(ODCOND,0)
// ODCOND<ODCD1>
extern volatile __bit                   ODCD1               __at(0x1D391);	// @ (0x3A72 * 8 + 1)
#define                                 ODCD1_bit           _BIT_ACCESS(ODCOND,1)
// ODCOND<ODCD2>
extern volatile __bit                   ODCD2               __at(0x1D392);	// @ (0x3A72 * 8 + 2)
#define                                 ODCD2_bit           _BIT_ACCESS(ODCOND,2)
// ODCOND<ODCD3>
extern volatile __bit                   ODCD3               __at(0x1D393);	// @ (0x3A72 * 8 + 3)
#define                                 ODCD3_bit           _BIT_ACCESS(ODCOND,3)
// ODCOND<ODCD4>
extern volatile __bit                   ODCD4               __at(0x1D394);	// @ (0x3A72 * 8 + 4)
#define                                 ODCD4_bit           _BIT_ACCESS(ODCOND,4)
// ODCOND<ODCD5>
extern volatile __bit                   ODCD5               __at(0x1D395);	// @ (0x3A72 * 8 + 5)
#define                                 ODCD5_bit           _BIT_ACCESS(ODCOND,5)
// ODCOND<ODCD6>
extern volatile __bit                   ODCD6               __at(0x1D396);	// @ (0x3A72 * 8 + 6)
#define                                 ODCD6_bit           _BIT_ACCESS(ODCOND,6)
// ODCOND<ODCD7>
extern volatile __bit                   ODCD7               __at(0x1D397);	// @ (0x3A72 * 8 + 7)
#define                                 ODCD7_bit           _BIT_ACCESS(ODCOND,7)
// ODCONE<ODCE0>
extern volatile __bit                   ODCE0               __at(0x1D410);	// @ (0x3A82 * 8 + 0)
#define                                 ODCE0_bit           _BIT_ACCESS(ODCONE,0)
// ODCONE<ODCE1>
extern volatile __bit                   ODCE1               __at(0x1D411);	// @ (0x3A82 * 8 + 1)
#define                                 ODCE1_bit           _BIT_ACCESS(ODCONE,1)
// ODCONE<ODCE2>
extern volatile __bit                   ODCE2               __at(0x1D412);	// @ (0x3A82 * 8 + 2)
#define                                 ODCE2_bit           _BIT_ACCESS(ODCONE,2)
// DAC1CON0<OE1>
extern volatile __bit                   OE1                 __at(0x1F4F5);	// @ (0x3E9E * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<OE2>
extern volatile __bit                   OE2                 __at(0x1F4F4);	// @ (0x3E9E * 8 + 4)
#define                                 OE2_bit             _BIT_ACCESS(DAC1CON0,4)
// MD1CON0<OPOL>
extern volatile __bit                   OPOL                __at(0x1E7D4);	// @ (0x3CFA * 8 + 4)
#define                                 OPOL_bit            _BIT_ACCESS(MD1CON0,4)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x1CEDC);	// @ (0x39DB * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// PIE0<OSFIE>
extern volatile __bit                   OSFIE               __at(0x1CC82);	// @ (0x3990 * 8 + 2)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE0,2)
// PIR0<OSFIF>
extern volatile __bit                   OSFIF               __at(0x1CD02);	// @ (0x39A0 * 8 + 2)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR0,2)
// IPR0<OSFIP>
extern volatile __bit                   OSFIP               __at(0x1CC02);	// @ (0x3980 * 8 + 2)
#define                                 OSFIP_bit           _BIT_ACCESS(IPR0,2)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x1FEC3);	// @ (0x3FD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// U1P1H<P1H>
extern volatile __bit                   P1H                 __at(0x1EF68);	// @ (0x3DED * 8 + 0)
#define                                 P1H_bit             _BIT_ACCESS(U1P1H,0)
// U1P2H<P2H>
extern volatile __bit                   P2H                 __at(0x1EF78);	// @ (0x3DEF * 8 + 0)
#define                                 P2H_bit             _BIT_ACCESS(U1P2H,0)
// U1P3H<P3H>
extern volatile __bit                   P3H                 __at(0x1EF88);	// @ (0x3DF1 * 8 + 0)
#define                                 P3H_bit             _BIT_ACCESS(U1P3H,0)
// CCPTMRS1<P5TSEL0>
extern volatile __bit                   P5TSEL0             __at(0x1FAF8);	// @ (0x3F5F * 8 + 0)
#define                                 P5TSEL0_bit         _BIT_ACCESS(CCPTMRS1,0)
// CCPTMRS1<P5TSEL1>
extern volatile __bit                   P5TSEL1             __at(0x1FAF9);	// @ (0x3F5F * 8 + 1)
#define                                 P5TSEL1_bit         _BIT_ACCESS(CCPTMRS1,1)
// CCPTMRS1<P6TSEL0>
extern volatile __bit                   P6TSEL0             __at(0x1FAFA);	// @ (0x3F5F * 8 + 2)
#define                                 P6TSEL0_bit         _BIT_ACCESS(CCPTMRS1,2)
// CCPTMRS1<P6TSEL1>
extern volatile __bit                   P6TSEL1             __at(0x1FAFB);	// @ (0x3F5F * 8 + 3)
#define                                 P6TSEL1_bit         _BIT_ACCESS(CCPTMRS1,3)
// CCPTMRS1<P7TSEL0>
extern volatile __bit                   P7TSEL0             __at(0x1FAFC);	// @ (0x3F5F * 8 + 4)
#define                                 P7TSEL0_bit         _BIT_ACCESS(CCPTMRS1,4)
// CCPTMRS1<P7TSEL1>
extern volatile __bit                   P7TSEL1             __at(0x1FAFD);	// @ (0x3F5F * 8 + 5)
#define                                 P7TSEL1_bit         _BIT_ACCESS(CCPTMRS1,5)
// CCPTMRS1<P8TSEL0>
extern volatile __bit                   P8TSEL0             __at(0x1FAFE);	// @ (0x3F5F * 8 + 6)
#define                                 P8TSEL0_bit         _BIT_ACCESS(CCPTMRS1,6)
// CCPTMRS1<P8TSEL1>
extern volatile __bit                   P8TSEL1             __at(0x1FAFF);	// @ (0x3F5F * 8 + 7)
#define                                 P8TSEL1_bit         _BIT_ACCESS(CCPTMRS1,7)
// I2C1PIE<PC1IE>
extern volatile __bit                   PC1IE               __at(0x1EBD2);	// @ (0x3D7A * 8 + 2)
#define                                 PC1IE_bit           _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PC1IF>
extern volatile __bit                   PC1IF               __at(0x1EBCA);	// @ (0x3D79 * 8 + 2)
#define                                 PC1IF_bit           _BIT_ACCESS(I2C1PIR,2)
// I2C2PIE<PC2IE>
extern volatile __bit                   PC2IE               __at(0x1EB22);	// @ (0x3D64 * 8 + 2)
#define                                 PC2IE_bit           _BIT_ACCESS(I2C2PIE,2)
// I2C2PIR<PC2IF>
extern volatile __bit                   PC2IF               __at(0x1EB1A);	// @ (0x3D63 * 8 + 2)
#define                                 PC2IF_bit           _BIT_ACCESS(I2C2PIR,2)
// ADPCH<PCH3>
extern volatile __bit                   PCH3                __at(0x1F78B);	// @ (0x3EF1 * 8 + 3)
#define                                 PCH3_bit            _BIT_ACCESS(ADPCH,3)
// ADPCH<PCH4>
extern volatile __bit                   PCH4                __at(0x1F78C);	// @ (0x3EF1 * 8 + 4)
#define                                 PCH4_bit            _BIT_ACCESS(ADPCH,4)
// ADPCH<PCH5>
extern volatile __bit                   PCH5                __at(0x1F78D);	// @ (0x3EF1 * 8 + 5)
#define                                 PCH5_bit            _BIT_ACCESS(ADPCH,5)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x1F9F0);	// @ (0x3F3E * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x1CB48);	// @ (0x3969 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x1CB49);	// @ (0x3969 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x1CB4A);	// @ (0x3969 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x1CB4B);	// @ (0x3969 * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x1CEE0);	// @ (0x39DC * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// PCON0<POR>
extern volatile __bit                   POR                 __at(0x1FF81);	// @ (0x3FF0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(PCON0,1)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0x1F7CF);	// @ (0x3EF9 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x1D5F8);	// @ (0x3ABF * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// SMT1PRH<PR10>
extern volatile __bit                   PR10                __at(0x1F8E2);	// @ (0x3F1C * 8 + 2)
#define                                 PR10_bit            _BIT_ACCESS(SMT1PRH,2)
// SMT1PRH<PR11>
extern volatile __bit                   PR11                __at(0x1F8E3);	// @ (0x3F1C * 8 + 3)
#define                                 PR11_bit            _BIT_ACCESS(SMT1PRH,3)
// SMT1PRH<PR12>
